W7D2/music_app/music_app/app/controllers/albums_controller.rb

  def create
    @album = Album.new(album_params)
    if @album.save
---
INSERT INTO "albums" ("title", "year", "created_at", "updated_at", "band_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "There is a Hell"], ["year", 2006], ["created_at", "2021-01-06 00:57:25.735663"], ["updated_at", "2021-01-06 00:57:25.735663"], ["band_id", 1]]

  def album_params
    if params["band"]
      @band = Band.find_by(name: params[:band][:name])
---
SELECT  "bands".* FROM "bands" WHERE "bands"."name" = $1 LIMIT $2  [["name", "Bring Me the Horizon"], ["LIMIT", 1]]