W7D2/music_app/music_app/app/views/bands/show.html.erb

SELECT "albums".* FROM "albums" WHERE "albums"."band_id" = $1  [["band_id", 1]]
---
<%= @band.name %>
<!--- band.albums.each do |album|