W7D2/music_app/music_app/app/views/albums/show.html.erb

SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
<ul>
  <li>Band: <%= Band.find(@album.band_id).name %></li>