W6D4/ninety_nine_cats/app/controllers/cats_controller.rb

  def update
    @Cat = Cat.find(params[:id])

    if @cat.update(cat_params)
---
SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
UPDATE "cats" SET "birth_date" = $1, "updated_at" = $2 WHERE "cats"."id" = $3  [["birth_date", "2013-05-19"], ["updated_at", "2021-01-03 05:37:19.302796"], ["id", 12]]